// 这里需要改楼层名，请和文件名及下面的floorId保持完全一致
// 楼层唯一标识符仅能由字母、数字、下划线组成，且不能由数字开头
// 推荐用法：第20层就用MT20，第38层就用MT38，地下6层就用MT_6（用下划线代替负号），隐藏3层用MT3h（h表示隐藏），等等
main.floors.MT18 = {
    "floorId": "MT18", // 楼层唯一标识符，需要和名字完全一致
    "title": "主塔 18 层", // 楼层中文名
    "name": "18", // 显示在状态栏中的层数
    "canFlyTo": true, // 该楼能否被楼传器飞到（不能的话在该楼也不允许使用楼传器）
    "canUseQuickShop": true, // 该层是否允许使用快捷商店
    "defaultGround": "ground", // 默认地面的图块ID（terrains中）
    "png": [], // 该层默认显示的所有图片；详细用法请查看文档“自定义素材”中的说明。
    // "color": [0,0,0,0.3], // 该层的默认画面色调。本项可不写（代表无色调），如果写需要是一个RGBA数组。
    // "weather": ["snow",5], // 该层的默认天气。本项可忽略表示晴天，如果写则第一项为"rain"或"snow"代表雨雪，第二项为1-10之间的数代表强度。
    // "bgm": "bgm.mp3", // 到达该层后默认播放的BGM。本项可忽略。
    "map": [ // 地图数据，需要是13x13，建议使用地图生成器来生成
        [  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3],
        [  3,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  3],
        [  3,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  3],
        [  3,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  3],
        [  3,  4,  4,  4,  4,  1,  1,  1,  4,  4,  4,  4,  3],
        [  3,  4,  4,  4,  1,  1,132,  1,  1,  4,  4,  4,  3],
        [  3,  4,  4,  4,  1,  1, 86,  1,  1,  4,  4,  4,  3],
        [  3,  4,  4,  4,  1,  1, 83,  1,  1,  4,  4,  4,  3],
        [  3,  4,  4,  4,  4,  1, 83,  1,  4,  4,  4,  4,  3],
        [  3,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  3],
        [  3,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  4,  3],
        [  3, 88,  0,  0,  0,  0,  0,  0,  0,  0,  0, 87,  3],
        [  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3,  3]
    ],
    "firstArrive": [ // 第一次到该楼层触发的事件

    ],
    "events": { // 该楼的所有可能事件列表
        "11,11": {
            "enable": false,
            "data": [
                {"type": "changeFloor", "loc": [11,11], "floorId": "MT19"}
            ]
        },
        "6,6": {
            "trigger": "action", 
            "data": [
                {"type": "openDoor", "loc": [6,6]}
            ]
        },
        "6,5": [
            {"type": "if", "condition": "flag:princess",
                "true": [
                ],
                "false": [
                    "\t[hero]\b[down,hero]公主，我来救你了，快和我一起离开这座塔吧！",
                    "\t[公主,princess]\b[up]不要，我自从被他们抓来后，饱受折磨，我一定要出了这口气！",
                    "\t[hero]\b[down,hero]刚刚我不是杀了一个红衣魔王吗？",
                    "\t[公主,princess]\b[up]那充其量只是一个小头目，真正的魔王还在楼上呢。",
                    "\t[？？？]哼，有种就上来杀我啊！",
                    {"type": "setValue", "name": "flag:princess", "value": "true"},
                    {"type": "show", "loc": [11,11]}
                ]
            },
            "\t[公主,princess]\b[up]快去杀了魔王为我出了这口气！",
        ]
    },
    "changeFloor": { // 楼层转换事件；该事件不能和上面的events有冲突（同位置点），否则会被覆盖
        "1,11": {"floorId": "MT17", "stair": "upFloor"},
    },
    "afterBattle": { // 战斗后可能触发的事件列表
    },
    "afterGetItem": { // 获得道具后可能触发的事件列表

    },
    "afterOpenDoor": { // 开完门后可能触发的事件列表

    },
    "cannotMove": { // 每个图块不可通行的方向
        // 可以在这里定义每个点不能前往哪个方向，例如悬崖边不能跳下去
        // "x,y": ["up", "left"], // (x,y)点不能往上和左走

    },
}

