// 这里需要改楼层名，请和文件名及下面的floorId保持完全一致
// 楼层唯一标识符仅能由字母、数字、下划线组成，且不能由数字开头
// 推荐用法：第20层就用MT20，第38层就用MT38，地下6层就用MT_6（用下划线代替负号），隐藏3层用MT3h（h表示隐藏），等等
main.floors.MT22 = {
    "floorId": "MT22", // 楼层唯一标识符，需要和名字完全一致
    "title": "主塔 22 层", // 楼层中文名
    "name": "22", // 显示在状态栏中的层数
    "canFlyTo": true, // 该楼能否被楼传器飞到（不能的话在该楼也不允许使用楼传器）
    "canUseQuickShop": true, // 该层是否允许使用快捷商店
    "defaultGround": "ground", // 默认地面的图块ID（terrains中）
    "png": [], // 该层默认显示的所有图片；详细用法请查看文档“自定义素材”中的说明。
    // "color": [0,0,0,0.3], // 该层的默认画面色调。本项可不写（代表无色调），如果写需要是一个RGBA数组。
    // "weather": ["snow",5], // 该层的默认天气。本项可忽略表示晴天，如果写则第一项为"rain"或"snow"代表雨雪，第二项为1-10之间的数代表强度。
    // "bgm": "bgm.mp3", // 到达该层后默认播放的BGM。本项可忽略。
    "map": [ // 地图数据，需要是13x13，建议使用地图生成器来生成
        [3,    3,    3,    3,    3,    3,    3,    3,    3,    3,    3,    3,    3],
        [3,    4,    4,    4,    4,    4,    88,   4,    4,    4,    4,    4,    3],
        [3,    4,    4,    4,    4,    4,    0,    4,    4,    4,    4,    4,    3],
        [3,    4,    4,    4,    4,    124,  0,    0,    4,    4,    4,    4,    3],
        [3,    86,   86,   86,   4,    4,    83,   4,    4,    86,   86,   86,   3],
        [3,    27,   27,   86,   4,    4,    53,   4,    4,    86,   28,   28,   3],
        [3,    87,   27,   228,  83,   53,   0,    53,   83,   228,  28,   87,   3],
        [3,    27,   27,   86,   4,    4,    53,   4,    4,    86,   28,   28,   3],
        [3,    86,   86,   86,   4,    4,    83,   4,    4,    86,   86,   86,   3],
        [3,    4,    4,    4,    86,   86,   228,  86,   86,   4,    4,    4,    3],
        [3,    4,    4,    4,    86,   32,   32,   32,   86,   4,    4,    4,    3],
        [3,    4,    4,    4,    86,   32,   87,   32,   86,   4,    4,    4,    3],
        [3,    3,    3,    3,    3,    3,    3,    3,    3,    3,    3,    3,    3],                         
    ],
    "firstArrive": [ // 第一次到该楼层触发的事件

    ],
    "events": { // 该楼的所有可能事件列表
        "5,3": [
            {"type": "if", "condition": "item:wand1>0 && item:wand2>0",
                "true": [
                    "\t[仙子,fairy]\b[down]你已经找齐了魔杖，我将给你封印最终的Boss。",
                    {"type": "animate", "name": "yongchang"},
                    {"type": "setBlock", "loc": [5,2], "number": 133, "floorId": "MT24"},
                    {"type": "setBlock", "loc": [6,2], "number": 134, "floorId": "MT24"},
                    {"type": "setBlock", "loc": [7,2], "number": 135, "floorId": "MT24"},
                    {"type": "setBlock", "loc": [5,3], "number": 136, "floorId": "MT24"},
                    {"type": "setBlock", "loc": [6,3], "number": 137, "floorId": "MT24"},
                    {"type": "setBlock", "loc": [7,3], "number": 138, "floorId": "MT24"},
                    {"type": "setBlock", "loc": [5,4], "number": 139, "floorId": "MT24"},
                    {"type": "setBlock", "loc": [7,4], "number": 140, "floorId": "MT24"},
                    {"type": "setBlock", "loc": [6,4], "number": 258, "floorId": "MT24"},
                    "\t[仙子,fairy]\b[down]看你了！加油！",
                    {"type": "hide", "time": 500}
                ],
                "false": [
                    "\t[仙子,fairy]\b[down]去收集剩下两根魔杖，我就能给你封印最终的Boss！"
                ]
            },
        ]
    },
    "changeFloor": { // 楼层转换事件；该事件不能和上面的events有冲突（同位置点），否则会被覆盖
        "6,1": {"floorId": "MT21", "stair": "upFloor"},
        "1,6": {"floorId": "MT23L", "loc": [11,6]},
        "11,6": {"floorId": "MT23R", "loc": [1,6]},
        "6,11": {"floorId": "MT23D", "loc": [6,1]}
    },
    "afterBattle": { // 战斗后可能触发的事件列表
    },
    "afterGetItem": { // 获得道具后可能触发的事件列表

    },
    "afterOpenDoor": { // 开完门后可能触发的事件列表

    },
    "cannotMove": { // 每个图块不可通行的方向
        // 可以在这里定义每个点不能前往哪个方向，例如悬崖边不能跳下去
        // "x,y": ["up", "left"], // (x,y)点不能往上和左走

    },
}

